In [47]:
import numpy as np
import pandas as pd

In [48]:
df = pd.DataFrame(np.random.randint(1,100,30).reshape(5,6))
df

    0   1   2   3   4   5
0  20  90  28  96  65  78
1   7  60  49  60  90  16
2   1  83  97  87  56  21
3  96  17  30  97  16  90
4  16   3  18  17  45  13

In [49]:
df = pd.DataFrame(np.random.randint(1,100,30).reshape(5,6),
columns =['col1','col2','col3','col4','col5','col6'])
df

   col1  col2  col3  col4  col5  col6
0    51    91    87    61     8    44
1    74    69    98     4    29    13
2    97    44    57    90    22    50
3    16     2    16    26    89    74
4    79    30    59    65    51    84

In [50]:
df = pd.DataFrame(np.random.randint(1,100,30).reshape(5,6),
columns =['col1','col2','col3','col4','col5','col6'],
index=['row1','row2','row3','row4','row5'])
df # by this we can rename the column and rows with (columns,row)

      col1  col2  col3  col4  col5  col6
row1    81    14     2    32    85    29
row2    95     2    48    60    69    86
row3     1    46    95    13    73    86
row4    73    68    84    75    23    54
row5    57    61    12    86    21     3

In [51]:
df = pd.DataFrame(np.arange(1,31).reshape(5,6),
columns =['col1','col2','col3','col4','col5','col6'],
index=['row1','row2','row3','row4','row5'])
df # this is done using arange method.

      col1  col2  col3  col4  col5  col6
row1     1     2     3     4     5     6
row2     7     8     9    10    11    12
row3    13    14    15    16    17    18
row4    19    20    21    22    23    24
row5    25    26    27    28    29    30

In [52]:
df = pd.DataFrame(np.arange(1,30).reshape(5,6),
columns =['col1','col2','col3','col4','col5','col6'],
index=['row1','row2','row3','row4','row5'])
df # this is done using arange method.

ValueError: cannot reshape array of size 29 into shape (5,6)

In [53]:
df2 = pd.DataFrame(data = [[1,3,5],[2,4,6],[6,8,9]])
df2

   0  1  2
0  1  3  5
1  2  4  6
2  6  8  9

In [54]:
df2.head(2)

   0  1  2
0  1  3  5
1  2  4  6

In [55]:
df2.tail(2)

   0  1  2
1  2  4  6
2  6  8  9

In [56]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       3 non-null      int64
 2   2       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [57]:
df2.describe()

              0         1         2
count  3.000000  3.000000  3.000000
mean   3.000000  5.000000  6.666667
std    2.645751  2.645751  2.081666
min    1.000000  3.000000  5.000000
25%    1.500000  3.500000  5.500000
50%    2.000000  4.000000  6.000000
75%    4.000000  6.000000  7.500000
max    6.000000  8.000000  9.000000

Indexing :

In [60]:
#Using column name(columns),row name(index(loc)),
# row index & column index number(iloc)

In [61]:
df[['col1','col2']] #This is column indexing.

      col1  col2
row1     1     2
row2     7     8
row3    13    14
row4    19    20
row5    25    26

In [62]:
print(type(df[['col1','col2']]))

<class 'pandas.core.frame.DataFrame'>

In [63]:
df['col3']

row1     3
row2     9
row3    15
row4    21
row5    27
Name: col3, dtype: int32

In [64]:
print(type(df['col3']))

<class 'pandas.core.series.Series'>

In [65]:
df.loc[['row1','row2']] #This is row indexing.

      col1  col2  col3  col4  col5  col6
row1     1     2     3     4     5     6
row2     7     8     9    10    11    12

In [66]:
print(type(df.loc[['row1','row2']]))

<class 'pandas.core.frame.DataFrame'>

In [67]:
df.loc['row3']

col1    13
col2    14
col3    15
col4    16
col5    17
col6    18
Name: row3, dtype: int32

In [68]:
print(type(df.loc['row3']))

<class 'pandas.core.series.Series'>

In [69]:
df.min()

col1    1
col2    2
col3    3
col4    4
col5    5
col6    6
dtype: int32

In [70]:
df.iloc[2:4,1:3] #This is row,column indexing
#indexing start from 0.
#[start:end] here end is excluded.

      col2  col3
row3    14    15
row4    20    21

In [71]:
df.isnull().sum() #This will give sum of null values.

col1    0
col2    0
col3    0
col4    0
col5    0
col6    0
dtype: int64

In [72]:
df['col1'].value_counts() #This will give the unique values present in the DataFrame.

1     1
7     1
13    1
19    1
25    1
Name: col1, dtype: int64

In [73]:
df['col1'].unique() #This will give the unique values present in the DataFrame.

array([ 1,  7, 13, 19, 25])

In [74]:
df.loc['row1'].unique()

array([1, 2, 3, 4, 5, 6])

In [75]:
df.loc['row1'].value_counts()

1    1
2    1
3    1
4    1
5    1
6    1
Name: row1, dtype: int64

Concating Dataframe :

In [76]:
class_a = pd.DataFrame({
    "student1":{"Math":80,"Physics":72,"English":82,"Chemistry":95},
    "student2":{"Math":82,"Physics":73,"English":83,"Chemistry":92},
    "student3":{"Math":83,"Physics":74,"English":84,"Chemistry":93},
    "student4":{"Math":84,"Physics":75,"English":85,"Chemistry":90},
})
class_b = pd.DataFrame({
    "student5":{"Math":80,"Physics":91,"English":72,"Chemistry":75},
    "student6":{"Math":81,"Physics":93,"English":73,"Chemistry":73},
    "student7":{"Math":78,"Physics":94,"English":74,"Chemistry":71},
    "student8":{"Math":84,"Physics":95,"English":75,"Chemistry":77},
})
class_c = pd.DataFrame({
    "student9":{"Math":78,"Physics":82,"English":87,"Chemistry":81},
    "student10":{"Math":76,"Physics":83,"English":86,"Chemistry":89},
    "student11":{"Math":79,"Physics":84,"English":89,"Chemistry":90},
    "student12":{"Math":81,"Physics":85,"English":72,"Chemistry":91},
})
class_d = pd.DataFrame({
    "student13":{"Math":86,"Physics":62,"English":78,"Chemistry":83},
    "student14":{"Math":83,"Physics":73,"English":81,"Chemistry":87},
    "student15":{"Math":84,"Physics":94,"English":83,"Chemistry":83},
    "student16":{"Math":80,"Physics":85,"English":75,"Chemistry":73},
})

print(class_a)
print(class_b)
print(class_c)

           student1  student2  student3  student4
Math             80        82        83        84
Physics          72        73        74        75
English          82        83        84        85
Chemistry        95        92        93        90
           student5  student6  student7  student8
Math             80        81        78        84
Physics          91        93        94        95
English          72        73        74        75
Chemistry        75        73        71        77
           student9  student10  student11  student12
Math             78         76         79         81
Physics          82         83         84         85
English          87         86         89         72
Chemistry        81         89         90         91

In [77]:
pd.concat([class_a,class_b,class_c])

,student1,student2,student3,student4,student5,student6,student7,student8,student9,student10,student11,student12
Math,80.0,82.0,83.0,84.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Physics,72.0,73.0,74.0,75.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
English,82.0,83.0,84.0,85.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Chemistry,95.0,92.0,93.0,90.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Math,NaN,NaN,NaN,NaN,80.0,81.0,78.0,84.0,NaN,NaN,NaN,NaN
Physics,NaN,NaN,NaN,NaN,91.0,93.0,94.0,95.0,NaN,NaN,NaN,NaN
English,NaN,NaN,NaN,NaN,72.0,73.0,74.0,75.0,NaN,NaN,NaN,NaN
Chemistry,NaN,NaN,NaN,NaN,75.0,73.0,71.0,77.0,NaN,NaN,NaN,NaN
Math,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,78.0,76.0,79.0,81.0
Physics,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,82.0,83.0,84.0,85.0
English,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,87.0,86.0,89.0,72.0
Chemistry,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,81.0,89.0,90.0,91.0

In [78]:
pd.concat([class_a,class_b,class_c],axis = 1)

,student1,student2,student3,student4,student5,student6,student7,student8,student9,student10,student11,student12
Math,80,82,83,84,80,81,78,84,78,76,79,81
Physics,72,73,74,75,91,93,94,95,82,83,84,85
English,82,83,84,85,72,73,74,75,87,86,89,72
Chemistry,95,92,93,90,75,73,71,77,81,89,90,91

Merging Dataframe :

In [79]:
data1 = {'key':['k0','k1','k2','k3'],'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3']}
data2 = {'key':['k1','k3','k4','k5'],'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']}
left = pd.DataFrame(data1)
right = pd.DataFrame(data2)
pd.merge(left,right)

  key   A   B   C   D
0  k1  a1  b1  c0  d0
1  k3  a3  b3  c1  d1